Table of Contents
 Class RemoteDataStream
Namespace
IdeaStatiCa.Plugin.ProjectContent
Assembly
IdeaStatiCa.Plugin.dll
MemoryStream which data are copied to IProjectContentStorage when method in Flush or Close is called and local data are changed
public class RemoteDataStream : MemoryStream, IDisposable
Inheritance
object
MarshalByRefObject
Stream
MemoryStream
RemoteDataStream
Implements
IDisposable
Inherited Members
 MemoryStream.GetBuffer()
 MemoryStream.TryGetBuffer(out ArraySegment<byte>)
 MemoryStream.Read(byte[], int, int)
 MemoryStream.ReadAsync(byte[], int, int, CancellationToken)
 MemoryStream.ReadByte()
 MemoryStream.CopyToAsync(Stream, int, CancellationToken)
 MemoryStream.Seek(long, SeekOrigin)
 MemoryStream.SetLength(long)
 MemoryStream.ToArray()
 MemoryStream.WriteTo(Stream)
 MemoryStream.CanRead
 MemoryStream.CanSeek
 MemoryStream.CanWrite
 MemoryStream.Capacity
 MemoryStream.Length
 MemoryStream.Position
 Stream.Null
 Stream.CopyToAsync(Stream)
 Stream.CopyToAsync(Stream, int)
 Stream.CopyTo(Stream)
 Stream.CopyTo(Stream, int)
 Stream.Dispose()
 Stream.FlushAsync()
 Stream.CreateWaitHandle()
 Stream.BeginRead(byte[], int, int, AsyncCallback, object)
 Stream.EndRead(IAsyncResult)
 Stream.ReadAsync(byte[], int, int)
 Stream.BeginWrite(byte[], int, int, AsyncCallback, object)
 Stream.WriteAsync(byte[], int, int)
 Stream.Synchronized(Stream)
 Stream.ObjectInvariant()
 Stream.CanTimeout
 Stream.ReadTimeout
 Stream.WriteTimeout
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 RemoteDataStream(string, IProjectContentStorage)
Constructor
public RemoteDataStream(string contentId, IProjectContentStorage storage)
Parameters
contentId string
Content ID
storage IProjectContentStorage
Storage
Properties
 ContentId
public string ContentId { get; }
Property Value
string
Methods
 Close()
Write data to storage if data are changed
public override void Close()
 Dispose(bool)
Releases the unmanaged resources used by the MemoryStream class and optionally releases the managed resources.
protected override void Dispose(bool disposing)
Parameters
disposing bool
true to release both managed and unmanaged resources; false to release only unmanaged resources.
 EndWrite(IAsyncResult)
Write data to stream and sets the stream 'Is Dirty' flag..
public override void EndWrite(IAsyncResult asyncResult)
Parameters
asyncResult IAsyncResult
 Flush()
Write data to storage if data are changed
public override void Flush()
 FlushAsync(CancellationToken)
Write data to storage if data are changed
public override Task FlushAsync(CancellationToken cancellationToken)
Parameters
cancellationToken CancellationToken
Returns
Task
 Write(byte[], int, int)
Write data to stream and set whether the stream 'Is Dirty' flag.
public override void Write(byte[] buffer, int offset, int count)
Parameters
buffer byte[]
offset int
count int
 WriteAsync(byte[], int, int, CancellationToken)
Write data to stream and sets the stream 'Is Dirty' flag.
public override Task WriteAsync(byte[] buffer, int offset, int count, CancellationToken cancellationToken)
Parameters
buffer byte[]
offset int
count int
cancellationToken CancellationToken
Returns
Task
 WriteByte(byte)
Write data to stream and sets the stream 'Is Dirty' flag.
public override void WriteByte(byte value)
Parameters
value byte
 Edit this page